Repository: Hendri-M/change_language
Catalog: lib/l10n/app_*.arb
Languages: ar, id, ja, ko

# description
source: Hello there, You are currently using the English language.
ar: مرحباً، أنت تستخدم حالياً اللغة الإنجليزية.
id: Halo! Saat ini Anda sedang menggunakan bahasa Indonesia.
ja: こんにちは, モンクレール ダウン 激安。
ko: 안녕하세요, 현재 한국어를 사용 중입니다.

# accept
source: Yes, proceed
ar: نعم، استمر
id: Ya, lanjutkan
ja: はい、続行する
ko: 예, 계속하기

# decline
source: No, cancel
ar: لا، قم بإلغاء
id: Tidak, batalkan
ja: いいえ、キャンセルする
ko: 아니요, 취소하기

# appBar
source: Select App Language
ar: حدد لغة التطبيق
id: Pilih Bahasa App
ja: アプリの言語を選択
ko: 앱 언어 선택

# centerText
source: This is another page displaying the language selected on the home page.
ar: هذه صفحة أخرى تعرض اللغة المحددة في الصفحة الرئيسية.
id: Ini adalah halaman lain yang menampilkan bahasa yang dipilih di halaman utama.
ja: これは、ホームページで選択した言語を表示する別のページです。
ko: 이 페이지는 홈 페이지에서 선택한 언어를 표시합니다.

# backHome
source: Return to Home
ar: العودة إلى الصفحة الرئيسية
id: Kembali ke Beranda
ja: ホームに戻る
ko: 홈으로 돌아가기

# nextButton
source: Go to Other Pages
ar: الانتقال إلى الصفحات الأخرى
id: Lanjut ke Halaman Lain
ja: 他のページに進む
ko: 다른 페이지로 이동

# settings
source: Application Settings
ar: إعدادات الاستخدام
id: Pengaturan Aplikasi
ja: アプリ設定
ko: 앱 설정

# settingBtn
source: Settings
ar: إعدادات
id: Pengaturan
ja: 設定
ko: 설정

# settingOther
source: Other Settings
ar: الإعدادات الأخرى
id: Pengaturan Lainnya
ja: その他の設定

# clearPref
source: Clear Preferences
ar: مسح التفضيلات واضحة
id: Hapus Preferensi
ja: プリファレンスをクリアする

# changeLanguage
source: Select a Different Language
ar: تحديد لغة مختلفة
id: Pilih Bahasa Lain
ja: 別の言語を選択する
ko: 다른 언어 선택
